import React from 'react';
import styled from 'styled-components/native';

const Agreement = () => {
  return (
    <Container>
      <Title>개인정보 수집 및 이용약관</Title>
      <ScrollContent>
        <Content>
          제1조 (목적){'\n'}
          {'\n'}이 약관은 BODYCHECK(이하 '회사'라 합니다)의 이용자로서 AI PT
          서비스인 BODYCHECK 서비스(이하 'BODYCHECK 서비스'라 합니다)를 이용하는
          자(이하 '이용자'라 합니다)와 BODYCHECK 서비스 제공자인 회사 사이의
          권리, 의무, 책임, 제반 절차 및 기타 필요한 사항을 규정함을 목적으로
          합니다.{'\n'}
          {'\n'}
          제2조 (정의){'\n'}
          {'\n'}① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.{'\n'}
          {'\n'}
          1. BODYCHECK 서비스'는 이용자가 선택한 운동을 실시간 피드백 해주는
          서비스를 의미합니다.{'\n'}
          2. '회원'이란 서비스에 접속하여 이 약관에 따라 서비스의 이용 계약을
          체결하고 서비스를 이용하는 자를 말합니다.{'\n'}
          3. '아이디(ID)'란 회원의 식별과 서비스 이용을 위하여 회원이 설정하고
          서비스가 승인한 문자와 숫자의 조합을 의미합니다.{'\n'}
          4. '비밀번호'란 회원이 부여받은 아이디와 일치된 회원임을 확인하고
          회원의 권익 및 비밀 보호를 위해 회원 자신이 설정한 문자와 숫자의
          조합을 의미합니다.{'\n'}
          {'\n'}
          제3조 (이용약관의 효력 및 변경){'\n'}
          {'\n'}① 이 약관은 회원 가입 시 회원에게 통지됨으로써 그 효력이
          발생합니다.{'\n'}② 회사는 필요한 경우 관련 법령을 위반하지 않는 범위
          내에서 이 약관을 변경할 수 있으며, 약관이 변경될 경우에는 적용 일자 및
          변경 사유를 명시하여 현행 약관과 함께 서비스 내에 공지합니다.{'\n'}③
          회원은 변경된 약관에 대해 거부할 권리가 있으며, 변경된 약관이 공지된
          후 7일 이내에 거부 의사를 표명하지 않으면 약관 변경에 동의한 것으로
          간주합니다.{'\n'}
          {'\n'}
          제4조 (회원 가입){'\n'}
          {'\n'}① 회원 가입은 서비스가 정한 가입 양식에 따라 회원 정보를
          기입하고, 이 약관에 동의한다는 의사 표시를 함으로써 성립합니다.{'\n'}
          {'\n'}
          제5조 (회원의 의무){'\n'}
          {'\n'}① 회원은 관계 법령, 이 약관의 규정, 이용 안내 및 서비스와
          관련하여 공지한 주의 사항을 준수하여야 하며, 기타 서비스의 업무에
          방해되는 행위를 하여서는 안 됩니다.{'\n'}② 회원은 서비스의 사전 승낙
          없이 서비스를 이용하여 어떠한 영리 행위도 할 수 없습니다.{'\n'}③
          회원은 서비스의 명시적 동의가 없는 한 서비스의 이용 권한, 기타 이용
          계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수
          없습니다.{'\n'}
          {'\n'}
          제6조 (서비스의 제공 및 변경){'\n'}
          {'\n'}① 서비스는 회원에게 다음과 같은 서비스를 제공합니다.{'\n'}
          {'\n'}
          1. 맞춤형 개인 PT 콘텐츠 제공{'\n'}
          2. 개인화된 운동 피드백 생성 및 제공{'\n'}
          3. 스트리밍 서비스 제공 및 초 단위 분석{'\n'}
          4. 운동 기록 저장 및 관리{'\n'}
          {'\n'}
          제7조 (서비스의 중단){'\n'}
          {'\n'}① 서비스는 컴퓨터 등 정보통신설비의 보수 점검, 교체 및 고장,
          통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로
          중단할 수 있습니다.{'\n'}② 제1항에 의한 서비스 중단의 경우에는
          서비스는 회원에게 사전 통지합니다. 단, 서비스가 통제할 수 없는 사유로
          인한 서비스의 중단(운영자의 고의나 과실이 없는 디스크 장애 등)으로
          인하여 사전 통지가 불가능한 경우에는 예외로 합니다.{'\n'}
          {'\n'}
          제8조 (계약 해지 및 이용 제한){'\n'}
          {'\n'}① 회사는 회원이 다음 각 호의 사유에 해당하는 경우, 사전 통지
          없이 이용 계약을 해지하거나 또는 서비스 이용을 제한할 수 있습니다.
          {'\n'}
          {'\n'}
          1. 가입 신청 시에 허위 내용을 등록한 경우{'\n'}
          2. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자
          거래질서를 위협하는 경우{'\n'}
          3. 서비스를 이용하여 법령과 이 약관이 금지하거나 공서양속에 반하는
          행위를 하는 경우{'\n'}
          {'\n'}
          제9조 (개인정보 보호){'\n'}
          {'\n'}① 서비스는 회원의 정보 수집 시 서비스 제공에 필요한 최소한의
          정보를 수집합니다.{'\n'}② 회원의 개인정보는 본인의 동의 없이 제3자에게
          제공할 수 없으며, 이에 대한 모든 책임은 서비스에 있습니다. 다만,
          다음의 경우는 예외로 합니다.{'\n'}
          {'\n'}
          1. 법령의 규정에 의한 경우{'\n'}
          2. 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가
          있는 경우{'\n'}
          {'\n'}
          제10조 (저작권){'\n'}
          {'\n'}① 서비스에서 제공하는 모든 콘텐츠(텍스트, 오디오 등)는
          저작권법에 의해 보호받습니다. 회원은 서비스에서 제공하는 콘텐츠를
          서비스의 사전 허가 없이 복제, 배포, 변형, 송신, 전시, 출판, 방송 등
          상업적 목적으로 이용할 수 없습니다.{'\n'}② 회원이 작성한 게시물의
          저작권은 해당 게시물의 작성자에게 귀속됩니다. 단, 회원은 서비스를
          이용하여 작성한 게시물을 서비스가 무상으로 사용할 수 있는 권리를
          서비스에 허락한 것으로 간주됩니다.{'\n'}
          {'\n'}
          제11조 (면책 조항){'\n'}
          {'\n'}① 서비스는 천재지변 또는 이에 준하는 불가항력으로 인하여
          서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
          {'\n'}
          {'\n'}
          제12조 (준거법 및 관할법원){'\n'}
          {'\n'}① 이 약관의 해석 및 서비스와 회원 간의 분쟁에 대해서는
          대한민국의 법을 적용합니다.{'\n'}② 서비스와 회원 간 발생한 분쟁에 관한
          소송은 서울중앙지방법원을 관할 법원으로 합니다.{'\n'}
          {'\n'}
          제13조 (부적합 콘텐츠 관련 정책){'\n'}
          {'\n'}
          회사는 이용자들이 신뢰할 수 있고 이용자 외 제3자에게 피해가 발생하지
          않도록 BODYCHECK 서비스를 통해 불법 또는 반 사회적인 콘텐츠를 생성하는
          것을 금지하고 있으며, 이를 BODYCHECK 서비스에 업로드하는 것 또한
          금지하고 있습니다.{'\n'}
          {'\n'}
          부칙{'\n'}본 운영정책은 2024년 10월 20일자로 개정되었습니다.{'\n'}
        </Content>
      </ScrollContent>
    </Container>
  );
};

export default Agreement;

const Container = styled.View`
  flex: 1;
  padding: 20px;
  background-color: #fff;
`;

const Title = styled.Text`
  font-size: 18px;
  font-weight: bold;
  color: black;
  margin-bottom: 20px;
`;

const ScrollContent = styled.ScrollView`
  flex: 1;
`;

const Content = styled.Text`
  font-size: 12px;
  line-height: 18px;
  color: #333;
  white-space: pre-wrap;
`;
